<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ChefDK and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.kitzy.pkg.ChefDK</string>
	<key>Input</key>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.chefdk</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Arguments</key>
		<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/chefdk-*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expand</string>
		</dict>
		<key>Processor</key>
		<string>FlatPkgUnpacker</string>
</dict>
<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
		<dict>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/expand/Distribution</string>
				<key>re_pattern</key>
				<string>pkg-ref id="com.getchef.pkg.chefdk" version="(?P&lt;version&gt;.*?)"</string>
		</dict>
</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/chefdk-*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/chefdk-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
