Description: Downloads the latest signed fleetctl pkg for macOS from the fleetdm/fleet GitHub releases.
Identifier: com.github.kitzy.download.fleetctl
Input:
  NAME: fleetctl
MinimumVersion: '2.3'
Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: fleetdm/fleet
    asset_regex: fleetctl_v.*_mac\.pkg
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
- Processor: EndOfCheckPhase
