Description: Downloads the latest fleetctl pkg from Fleet and renames it with the version.
Identifier: com.github.kitzy.pkg.fleetctl
Input:
  NAME: fleetctl
MinimumVersion: '2.3'
ParentRecipe: com.github.kitzy.download.fleetctl
Process:
- Processor: FindAndReplace
  Comment: Strip the "fleet-v" prefix from the GitHub release tag to get the fleetctl version.
  Arguments:
    find: fleet-v
    replace: ''
    input_string: '%version%'
    result_output_var_name: pkg_version
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%pkg_version%.pkg'
