<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RubyMine using mosen's download recipe and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.kitzy.pkg.RubyMine</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mosen.download.RubyMine</string>
	<key>Process</key>
	    <array>
	        <dict>
	            <key>Processor</key>
	            <string>AppDmgVersioner</string>
	            <key>Arguments</key>
	            <dict>
	                <key>dmg_path</key>
	                <string>%pathname%</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>PkgRootCreator</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pkgroot</key>
	                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
	                <key>pkgdirs</key>
	                <dict>
	                    <key>Applications</key>
	                    <string>0775</string>
	                </dict>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>Copier</string>
	            <key>Arguments</key>
	            <dict>
	                <key>source_path</key>
	                <string>%pathname%/RubyMine.app</string>
	                <key>destination_path</key>
	                <string>%pkgroot%/Applications/RubyMine.app</string>
	            </dict>
	        </dict>
	        <dict>
	            <key>Processor</key>
	            <string>PkgCreator</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pkg_request</key>
	                <dict>
	                    <key>pkgname</key>
	                    <string>%NAME%-%version%</string>
	                    <key>pkgdir</key>
	                    <string>%RECIPE_CACHE_DIR%</string>
	                    <key>id</key>
	                    <string>com.jetbrains.rubymine.pkg</string>
	                    <key>options</key>
	                    <string>purge_ds_store</string>
	                    <key>chown</key>
	                    <array>
	                        <dict>
	                            <key>path</key>
	                            <string>Applications</string>
	                            <key>user</key>
	                            <string>root</string>
	                            <key>group</key>
	                            <string>admin</string>
	                        </dict>
	                    </array>
	                </dict>
	            </dict>
	        </dict>
	    </array>
		</dict>
</plist>
