<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of GPG Suite. Based on gerardkok's recipe.</string>
		<key>Identifier</key>
		<string>com.github.kitzy.download.GPGSuite</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GPGSuite</string>
			<key>SPARKLE_FEED_URL</key>
			<string>https://gpgtools.org/releases/gpgsuite/appcast.xml</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.3.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>%SPARKLE_FEED_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: GPGTools GmbH (PKV8ZPD836)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/Install.pkg</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
