Comment: Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Raycast and creates a package.
Identifier: com.github.kitzy.pkg.Raycast
Input:
  NAME: Raycast
MinimumVersion: '2.3'
ParentRecipe: com.github.dataJAR-recipes.download.Raycast
Process:
- Processor: AppPkgCreator
